c5/src/Catalogs/Contracts/Contracts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Contracts</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Organizations</owners>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAdvances</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAdvancesMonthly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerBank</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerCashFlow</name>
    <type>
      <types>CatalogRef.CashFlows</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerDelivery</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomerFactor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerPayment</name>
    <type>
      <types>EnumRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerPrices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerRate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerRateType</name>
    <type>
      <types>EnumRef.CurrencyRates</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerTerms</name>
    <type>
      <types>CatalogRef.Terms</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerVATAdvance</name>
    <type>
      <types>CatalogRef.VAT</types>
    </type>
  </attributes>
  <attributes>
    <name>DateEnd</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DateStart</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Export</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Import</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Signed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>CatalogRef.ContractStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>Template</name>
    <type>
      <types>DocumentRef.Document</types>
    </type>
  </attributes>
  <attributes>
    <name>Vendor</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorAdvances</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorAdvancesMonthly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorBank</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorCashFlow</name>
    <type>
      <types>CatalogRef.CashFlows</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorDelivery</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VendorFactor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorPayment</name>
    <type>
      <types>EnumRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorPrices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorRate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorRateType</name>
    <type>
      <types>EnumRef.CurrencyRates</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorTerms</name>
    <type>
      <types>CatalogRef.Terms</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Services</name>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>VendorItems</name>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>VendorServices</name>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/InformationRegisters/Settings/Settings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Settings</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Value</name>
    <type>
      <types>Characteristic.Settings</types>
    </type>
  </resources>
  <dimensions>
    <name>Parameter</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.Settings</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/Enums/PaymentMethods/PaymentMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>PaymentMethods</name>
  <enumValues>
    <name>Cash</name>
  </enumValues>
  <enumValues>
    <name>Check</name>
  </enumValues>
  <enumValues>
    <name>Visa</name>
  </enumValues>
  <enumValues>
    <name>Mastercard</name>
  </enumValues>
  <enumValues>
    <name>AmericanExpress</name>
  </enumValues>
  <enumValues>
    <name>EFT</name>
  </enumValues>
  <enumValues>
    <name>Bank</name>
  </enumValues>
  <enumValues>
    <name>PayPal</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
  <enumValues>
    <name>ExpenseReport</name>
  </enumValues>
</mdclass:Enum>

c5/src/Catalogs/Contracts/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	Forms.RedefineOpeningModeForLinux ( ThisObject );
	if ( Object.Ref.IsEmpty () ) then
		fillNew ();
	endif;
	StandardButtons.Arrange ( ThisObject );
	readAppearance ();
	Appearance.Apply ( ThisObject );

EndProcedure

&AtServer
Procedure fillNew ()
	
	if ( not Parameters.CopyingValue.IsEmpty () ) then
		return;
	endif;
	setFlags ();
	setCurrency ();
	setCompany ();
	setTerms ();
	setVATAdvance ();
	
EndProcedure

&AtServer
Procedure setFlags ()
	
	data = DF.Values ( Object.Owner, "Customer, Vendor" );
	Object.Customer = data.Customer;
	Object.Vendor = data.Vendor;
	
EndProcedure 

&AtServer
Procedure setCurrency ()
	
	if ( Object.Currency.IsEmpty () ) then
		Object.Currency = Application.Currency ();
	endif;
	
EndProcedure 

&AtServer
Procedure setCompany ()
	
	if ( not Object.Company.IsEmpty () ) then
		return;
	endif; 
	settings = Logins.Settings ( "Company" );
	Object.Company = settings.Company;
	
EndProcedure 

&AtServer
Procedure setTerms ()
	
	if ( Object.Customer ) then
		Object.CustomerTerms = Constants.Terms.Get ();
		Object.CustomerPayment = Constants.PaymentMethod.Get ();
	endif;
	if ( Object.Vendor ) then
		Object.VendorTerms = Constants.VendorTerms.Get ();
		Object.VendorPayment = Constants.VendorPaymentMethod.Get ();
	endif; 
	
EndProcedure 

&AtServer
Procedure setVATAdvance ()

	s = "
	|select Settings.Value as Value
	|from InformationRegister.Settings.SliceLast ( ,
	|	Parameter = value ( ChartOfCharacteristicTypes.Settings.VATAdvance )
	|) as Settings
	|";
	q = new Query ( s );
	table = q.Execute ().Unload ();
	value = ? ( table.Count () = 0, undefined, table [ 0 ].Value );
	if ( Object.Customer ) then
		Object.CustomerVATAdvance = value;
	endif;
	if ( Object.Vendor ) then
		Object.VendorVATAdvance = value;
	endif;
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|CustomerPage show Object.Customer;
	|VendorPage show Object.Vendor;
	|CustomerBank enable Object.CustomerPayment <> Enum.PaymentMethods.Cash;
	|VendorBank enable Object.VendorPayment <> Enum.PaymentMethods.Cash;
	|CustomerVATAdvance show Object.Customer;
	|VendorVATAdvance show Object.Vendor;
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure FillCheckProcessingAtServer ( Cancel, CheckedAttributes )
	
	if ( not Periods.Ok ( Object.DateStart, Object.DateEnd ) ) then
		Cancel = true;
		return;
	endif;
	if ( not checkPrices () ) then
		Cancel = true;
		return;
	endif; 
	
EndProcedure

&AtServer
Function checkPrices ()
	
	tables = new Array ();
	if ( Object.Customer ) then
		tables.Add ( Items.Items );
		tables.Add ( Items.Services );
	endif; 
	if ( Object.Vendor ) then
		tables.Add ( Items.VendorItems );
		tables.Add ( Items.VendorServices );
	endif; 
	return checkTables ( tables );
	
EndFunction 

&AtServer
Function checkTables ( Tables )
	
	error = false;
	for each table in Tables do
		if ( table = Items.Items
			or table = Items.VendorItems ) then
			columns = "Item, Package, Feature";
		else
			columns = "Item, Feature";
		endif; 
		doubles = Collections.GetDoubles ( Forms.ItemValue ( ThisObject, table ), columns );
		if ( doubles.Count () > 0 ) then
			name = table.Name;
			for each row in doubles do
				Output.DoubleItems ( , Output.Row ( name, row.LineNumber, "Item" ) );
			enddo; 
			error = true;
		endif; 
	enddo; 
	return not error;
	
EndFunction 

// *****************************************
// *********** Group Form

&AtClient
Procedure CustomerOnChange ( Item )
	
	applyCustomer ();
	Appearance.Apply ( ThisObject, "Object.Customer" );
	
EndProcedure

&AtClient
Procedure applyCustomer ()
	
	if ( Object.Customer ) then
		return;
	endif; 
	Object.CustomerPrices = undefined;
	Object.CustomerTerms = undefined;
	Object.CustomerDelivery = 0;
	Object.Export = false;
	Object.CustomerVATAdvance = undefined;
	
EndProcedure

&AtClient
Procedure VendorOnChange ( Item )
	
	applyVendor ();
	Appearance.Apply ( ThisObject, "Object.Vendor" );
	
EndProcedure

&AtClient
Procedure applyVendor ()
	
	if ( Object.Vendor ) then
		return;
	endif; 
	Object.VendorPrices = undefined;
	Object.VendorTerms = undefined;
	Object.VendorDelivery = 0;
	Object.Import = false;
	Object.VendorVATAdvance = undefined;
	
EndProcedure

&AtClient
Procedure CustomerPaymentOnChange ( Item )
	
	resetCustomerBank ();
	Appearance.Apply ( ThisObject, "Object.CustomerPayment" );
	
EndProcedure

&AtClient
Procedure resetCustomerBank ()
	
	if ( Object.CustomerPayment = PredefinedValue ( "Enum.PaymentMethods.Cash" ) ) then
		Object.CustomerBank = undefined;
	endif; 
	
EndProcedure 

&AtClient
Procedure VendorPaymentOnChange ( Item )
	
	resetVendorBank ();
	Appearance.Apply ( ThisObject, "Object.VendorPayment" );
	
EndProcedure

&AtClient
Procedure resetVendorBank ()
	
	if ( Object.VendorPayment = PredefinedValue ( "Enum.PaymentMethods.Cash" ) ) then
		Object.VendorBank = undefined;
	endif; 

EndProcedure 

// *****************************************
// *********** Table Items

&AtClient
Procedure ItemsItemOnChange ( Item )
	
	setPackage ( Items.Items );
	
EndProcedure

&AtClient
Procedure setPackage ( Table )
	
	row = Table.CurrentData;
	row.Package = DF.Pick ( row.Item, "Package" );
	
EndProcedure 

// *****************************************
// *********** Table VendorItems

&AtClient
Procedure VendorItemsItemOnChange ( Item )
	
	setPackage ( Items.VendorItems );
	
EndProcedure
